src/cf/Reports/вогАнкетаСБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Report>
		<Properties>
			<Name>вогАнкетаСБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/вогСвязиКонтактныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогСвязиКонтактныхЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыСвязейКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_Состояние</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_РольКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСвязи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогОбъектыСвязейКонтаткныхЛиц</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогРолиКонтактныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогРолиКонтактныхЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСвязи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогОбъектыСвязейКонтаткныхЛиц</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CRM_РольКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ОбъектыЗначенийКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ОбъектыЗначенийКлассификаторов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_ДополнительныеРеквизитыКлассификаторов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.вогАнкета</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_Классификаторы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_АналитикаКлассификаторов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеКлассификатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогСвязиЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогСвязиЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСвязи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогОбъектыСвязейПартнеров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/CRM_Состояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_Состояние</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноНеРаботает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/вогАнкетаСБ/Ext/ObjectModule.bsl
Функция СформироватьДанныеОтчета() Экспорт
	
	ЭтоИП 			= Ложь;
	ЕстьДиректор 	= Ложь;
	ЕстьСобственник = Ложь;
	ЕстьПодписант 	= Ложь;
	
	Если ЮрЛицо.ОрганизационноПравоваяФорма.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		Макет = ПолучитьМакет("МакетЮрЛицо");
		ТекстЗапроса = ТекстЗапросаЮрЛица();
	Иначе
		Макет = ПолучитьМакет("МакетФизЛицо");
		ТекстЗапроса = ТекстЗапросаФизЛица();
		ЭтоИП = Истина;
	КонецЕсли;
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьДанные 			= Макет.ПолучитьОбласть("ОбластьДанные");
	Если Не ЭтоИП Тогда
		ОбластьДиректор 	= Макет.ПолучитьОбласть("ОбластьДиректор");
		ОбластьСобственник 	= Макет.ПолучитьОбласть("ОбластьСобственник");
	КонецЕсли;
	ОбластьПодписант 		= Макет.ПолучитьОбласть("ОбластьПодписант");
	
	ТабДокумент 			= Новый ТабличныйДокумент;
	
	// ++ Классификаторы
	КлассификаторСведенияОРегистрации 
		= ПланыВидовХарактеристик.CRM_Классификаторы.НайтиПоНаименованию("Сведения о регистрации", Истина);
	ЗначениеКлассификатораРегистрирующийОрган 
		= Справочники.CRM_ЗначенияКлассификаторов.НайтиПоНаименованию("Регистрирующий орган", Истина,, КлассификаторСведенияОРегистрации);
	ЗначениеКлассификатораДатаРегистрации 
		= Справочники.CRM_ЗначенияКлассификаторов.НайтиПоНаименованию("Дата регистрации", Истина,, КлассификаторСведенияОРегистрации);
	// -- Классификаторы
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ЮрЛицо);
	Запрос.УстановитьПараметр("ЗначениеКлассификатораРегистрирующийОрган", 	ЗначениеКлассификатораРегистрирующийОрган);
	Запрос.УстановитьПараметр("ЗначениеКлассификатораДатаРегистрации", 		ЗначениеКлассификатораДатаРегистрации);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДанные = РезультатЗапроса[5].Выбрать();//ВыборкаДанные = РезультатЗапроса[3].Выбрать();
	
	Пока ВыборкаДанные.Следующий() Цикл
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДанные);
		ОбластьДанные.Параметры.Заполнить(ВыборкаДанные);
		
		Если ЭтоИП Тогда
			
			// Данные ИП
			ОбластьДанные.Параметры.ДатаМестоРождения 
				= СформироватьПредставлениеДатыМестаРождения(ВыборкаДанные);
				
			ОбластьДанные.Параметры.РегОрганДатаРегистрации 
				= СформироватьПредставлениеРегОрганДатаРегистрации(ВыборкаДанные);
				
			// Номера телефонов собственника
			// ++ VOG Солодов В.В. 19.02.2020 CRM-370
			ВыборкаКИ = РезультатЗапроса[9].Выбрать();
			// До изменения
			//ВыборкаКИ = РезультатЗапроса[8].Выбрать();
			// -- VOG Солодов В.В. 19.02.2020
			
			КИ_Телефоны = "";
			
			Пока ВыборкаКИ.Следующий() Цикл
				
				Если КИ_Телефоны = "" Тогда
					Разделитель = "";
				Иначе
					Разделитель = "; ";
				КонецЕсли;
				
				КИ_Телефоны = КИ_Телефоны + Разделитель + ВыборкаКИ.Представление;	
				
			КонецЦикла;
			
			ОбластьДанные.Параметры.Телефон = КИ_Телефоны;
				
			// Адреса торговых точек	
			ВыборкаТТ = РезультатЗапроса[7].Выбрать();
			ОбластьДанные.Параметры.АдресаТТ = СформироватьПредставлениеАдресовТТ(ВыборкаТТ);
		
			// Данные подписант
			Если Не РезультатЗапроса[6].Пустой() Тогда
				
				ЕстьПодписант = Истина;
				
				ВыборкаКИ_Подписант = РезультатЗапроса[6].Выбрать();
				
				Пока ВыборкаКИ_Подписант.Следующий() Цикл
				
					ОбластьПодписант.Параметры.Заполнить(ВыборкаКИ_Подписант);
					ОбластьПодписант.Параметры.ПодписантДатаМестоРождения 
						= СформироватьПредставлениеДатыМестаРождения(ВыборкаКИ_Подписант);
				
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			// Данные директор
			Если Не РезультатЗапроса[6].Пустой() Тогда
				
				ЕстьДиректор = Истина;
				
				ВыборкаКИ_Директор = РезультатЗапроса[6].Выбрать();
				
				Пока ВыборкаКИ_Директор.Следующий() Цикл
					
					ОбластьДиректор.Параметры.Заполнить(ВыборкаКИ_Директор);
					ОбластьДиректор.Параметры.ДиректорДатаМестоРождения 
						= СформироватьПредставлениеДатыМестаРождения(ВыборкаКИ_Директор);
					
				КонецЦикла;
				
			КонецЕсли;
			// Данные собственник
			Если Не РезультатЗапроса[7].Пустой() Тогда
				
				ЕстьСобственник = Истина;
				
				ВыборкаКИ_Собственник = РезультатЗапроса[7].Выбрать();
				
				Пока ВыборкаКИ_Собственник.Следующий() Цикл
					
					ОбластьСобственник.Параметры.Заполнить(ВыборкаКИ_Собственник);
					ОбластьСобственник.Параметры.СобственникДатаМестоРождения 
						= СформироватьПредставлениеДатыМестаРождения(ВыборкаКИ_Собственник);
					
				КонецЦикла;
				
			КонецЕсли;
		
			// Данные подписант
			Если Не РезультатЗапроса[8].Пустой() Тогда
				
				ЕстьПодписант = Истина;
				
				ВыборкаКИ_Подписант = РезультатЗапроса[8].Выбрать();
				
				Пока ВыборкаКИ_Подписант.Следующий() Цикл
				
					ОбластьПодписант.Параметры.Заполнить(ВыборкаКИ_Подписант);
					ОбластьПодписант.Параметры.ПодписантДатаМестоРождения 
						= СформироватьПредставлениеДатыМестаРождения(ВыборкаКИ_Подписант);
				
				КонецЦикла;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьЗаголовок);	
	ТабДокумент.Вывести(ОбластьДанные);
	
	// ++ VOG Солодов В.В. 12.07.2019 task 458
	Если Не ЭтоИП Тогда
		ТабДокумент.Вывести(ОбластьДиректор);
		ТабДокумент.Вывести(ОбластьСобственник);
	КонецЕсли;
	// До изменения
	//Если Не ЭтоИП Тогда
	//	Если ЕстьДиректор Тогда
	//		ТабДокумент.Вывести(ОбластьДиректор);
	//	КонецЕсли;
	//	Если ЕстьСобственник Тогда
	//		ТабДокумент.Вывести(ОбластьСобственник);
	//	КонецЕсли;
	//КонецЕсли;
	// -- VOG Солодов В.В. 12.07.2019
	
	// ++ VOG Солодов В.В. 12.07.2019 task 458
	// До изменения
	//Если ЕстьПодписант Тогда
	//	ТабДокумент.Вывести(ОбластьПодписант);
	//КонецЕсли;
	// -- VOG Солодов В.В. 12.07.2019
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПредставлениеАдресовТТ(Выборка)
	
	ПредставлениеАдресовТТ = "";
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыСтроки = Новый Структура;
		ПараметрыСтроки.Вставить("ПредставлениеАдресовТТ", 	ПредставлениеАдресовТТ);
		ПараметрыСтроки.Вставить("Разделитель", 			?(ПредставлениеАдресовТТ = "", "", "; " + Символы.ПС));
		ПараметрыСтроки.Вставить("НаименованиеТТ", 			Выборка.Наименование);
		ПараметрыСтроки.Вставить("Перенос", 				Символы.ПС);
		ПараметрыСтроки.Вставить("ПредставлениеАдреса", 	Выборка.Представление);
		
		Шаблон = НСтр("ru = '[ПредставлениеАдресовТТ][Разделитель]""[НаименованиеТТ]""[Перенос]Адрес: [ПредставлениеАдреса]'");
		ПредставлениеАдресовТТ = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыСтроки);
		
	КонецЦикла;
	
	Возврат ПредставлениеАдресовТТ;
	
КонецФункции

Функция СформироватьПредставлениеДатыМестаРождения(Выборка)
	
	Разделитель = "";
	
	Если ЗначениеЗаполнено(Выборка.ДатаРождения)
		И ЗначениеЗаполнено(Выборка.МестоРождения) Тогда
		
		Разделитель = ", ";
		
	КонецЕсли;
		
	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("ДатаРождения", 	Формат(Выборка.ДатаРождения, "ДЛФ=DD"));
	ПараметрыСтроки.Вставить("Разделитель", 	Разделитель);
	ПараметрыСтроки.Вставить("МестоРождения", 	Выборка.МестоРождения);
	
	Шаблон 							= НСтр("ru = '[ДатаРождения][Разделитель][МестоРождения]'");
	ПредставлениеДатыМестаРождения 	= СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыСтроки);
	
	Возврат ПредставлениеДатыМестаРождения;
	
КонецФункции

Функция СформироватьПредставлениеРегОрганДатаРегистрации(Выборка)
	
	Разделитель = "";
	
	Если ЗначениеЗаполнено(Выборка.РегистрирующийОрган)
		И ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		
		Разделитель = ", ";
		
	КонецЕсли;
		
	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("РегистрирующийОрган", 	Выборка.РегистрирующийОрган);
	ПараметрыСтроки.Вставить("Разделитель", 			Разделитель);
	ПараметрыСтроки.Вставить("ДатаРегистрации", 		Формат(Выборка.ДатаРегистрации, "ДЛФ=DD"));
	
	Шаблон 							= НСтр("ru = '[РегистрирующийОрган][Разделитель][ДатаРегистрации]'");
	ПредставлениеРегОрганДатаРегистрации 	= СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыСтроки);
	
	Возврат ПредставлениеРегОрганДатаРегистрации;
	
КонецФункции

Функция ТекстЗапросаЮрЛица()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вогЮридическиеЛица.Ссылка КАК Ссылка,
	|	вогЮридическиеЛица.НаименованиеПолное КАК Наименование,
	|	вогЮридическиеЛица.CRM_ИНН КАК CRM_ИНН,
	|	вогЮридическиеЛица.CRM_ОГРН КАК CRM_ОГРН
	|ПОМЕСТИТЬ ВТ_ЮридическиеЛица
	|ИЗ
	|	Справочник.вогЮридическиеЛица КАК вогЮридическиеЛица
	|ГДЕ
	|	вогЮридическиеЛица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЮридическиеЛица.Ссылка КАК Ссылка,
	|	вогЮридическиеЛица_КИ.Представление КАК Представление,
	|	вогЮридическиеЛица_КИ.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_КИ
	|ИЗ
	|	ВТ_ЮридическиеЛица КАК ВТ_ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вогЮридическиеЛица.КонтактнаяИнформация КАК вогЮридическиеЛица_КИ
	|		ПО ВТ_ЮридическиеЛица.Ссылка = вогЮридическиеЛица_КИ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЮридическиеЛица.Ссылка КАК Ссылка,
	|	ВТ_ЮридическиеЛица.Наименование КАК Наименование,
	|	ВТ_ЮридическиеЛица.CRM_ИНН КАК CRM_ИНН,
	|	ВТ_ЮридическиеЛица.CRM_ОГРН КАК CRM_ОГРН,
	|	ФактическиеАдреса.Представление КАК ФактическийАдрес,
	|	ЮридическиеАдреса.Представление КАК ЮридическийАдрес,
	|	Телефоны.Представление КАК Телефон,
	|	ЭлектроннаяПочта.Представление КАК ЭлектроннаяПочта
	|ПОМЕСТИТЬ ВТ_ДанныеКонтрагента
	|ИЗ
	|	ВТ_ЮридическиеЛица КАК ВТ_ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КИ КАК ФактическиеАдреса
	|		ПО ВТ_ЮридическиеЛица.Ссылка = ФактическиеАдреса.Ссылка
	|			И (ФактическиеАдреса.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридическогоЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КИ КАК ЮридическиеАдреса
	|		ПО ВТ_ЮридическиеЛица.Ссылка = ЮридическиеАдреса.Ссылка
	|			И (ЮридическиеАдреса.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресЮридическогоЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КИ КАК Телефоны
	|		ПО ВТ_ЮридическиеЛица.Ссылка = Телефоны.Ссылка
	|			И (Телефоны.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонЮридическогоЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КИ КАК ЭлектроннаяПочта
	|		ПО ВТ_ЮридическиеЛица.Ссылка = ЭлектроннаяПочта.Ссылка
	|			И (ЭлектроннаяПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailЮридическогоЛица))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//++ VOG Иванов С.А. 22.11.2019 ID заявки: 000000911 
	|ВЫБРАТЬ
	|	ВТ_ДанныеКонтрагента.Ссылка КАК Ссылка,
	|	вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК КонтактноеЛицо,
	|	вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица КАК CRM_РольКонтактногоЛица,
	|	вогСвязиКонтактныхЛиц.Собственник КАК Собственник
	|ПОМЕСТИТЬ втКонтакты
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиКонтактныхЛиц КАК вогСвязиКонтактныхЛиц
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.ОбъектСвязи
	|			И (вогСвязиКонтактныхЛиц.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Работает))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеКонтрагента.Ссылка,
	|	вогРолиКонтактныхЛиц.КонтактноеЛицо,
	|	вогРолиКонтактныхЛиц.CRM_РольКонтактногоЛица,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогРолиКонтактныхЛиц КАК вогРолиКонтактныхЛиц
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = вогРолиКонтактныхЛиц.ОбъектСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКонтакты.Ссылка КАК Ссылка,
	|	втКонтакты.КонтактноеЛицо КАК КонтактноеЛицо,
	|	втКонтакты.CRM_РольКонтактногоЛица КАК CRM_РольКонтактногоЛица,
	|	МАКСИМУМ(втКонтакты.Собственник) КАК Собственник
	|ПОМЕСТИТЬ втКонтактактныеЛицаСгруппированные
	|ИЗ
	|	втКонтакты КАК втКонтакты
	|
	|СГРУППИРОВАТЬ ПО
	|	втКонтакты.Ссылка,
	|	втКонтакты.КонтактноеЛицо,
	|	втКонтакты.CRM_РольКонтактногоЛица
	|;
	|
	//-- VOG Иванов С.А. 22.11.2019 ID заявки: 000000911
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДанныеКонтрагента.Ссылка КАК Ссылка,
	|	ВТ_ДанныеКонтрагента.Наименование КАК Наименование,
	|	ВТ_ДанныеКонтрагента.CRM_ИНН КАК ИНН,
	|	ВТ_ДанныеКонтрагента.CRM_ОГРН КАК ОГРН,
	|	ВТ_ДанныеКонтрагента.ФактическийАдрес КАК ФактическийАдрес,
	|	ВТ_ДанныеКонтрагента.ЮридическийАдрес КАК ЮридическийАдрес,
	|	ВТ_ДанныеКонтрагента.Телефон КАК Телефон,
	|	ВТ_ДанныеКонтрагента.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	|	""Анкета для проверки контрагента в СБ (для ЮЛ)"" КАК ЗаголовокШапки,
	|	ОбъектыЗначенийКлассификаторов.ЗначениеРеквизита КАК РегистрирующийОрган,
	|	ОбъектыЗначенийКлассификаторов_1.ЗначениеРеквизита КАК ДатаРегистрации
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК ОбъектыЗначенийКлассификаторов
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = ОбъектыЗначенийКлассификаторов.Объект
	|			И (ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора = &ЗначениеКлассификатораРегистрирующийОрган)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК ОбъектыЗначенийКлассификаторов_1
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = ОбъектыЗначенийКлассификаторов_1.Объект
	|			И (ОбъектыЗначенийКлассификаторов_1.ЗначениеКлассификатора = &ЗначениеКлассификатораДатаРегистрации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК ДиректорФИО,
	|	ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).ДатаРождения КАК ДатаРождения,
	|	ДиректорМестаРождения.Представление КАК МестоРождения,
	|	ДиректорАдресаРегистрации.Представление КАК ДиректорАдресРегистрации,
	|	ДиректорАдресаПроживания.Представление КАК ДиректорАдресМестожительства,
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|	ЕСТЬNULL(ДокументыДиректор.Представление, ДокументыДиректорИн.Представление) КАК ДиректорДанныеПаспорта,
	// До изменения
	//|	ДокументыДиректор.Представление КАК ДиректорДанныеПаспорта,
	// -- VOG Солодов В.В. 19.02.2020
	|	ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).вогГражданство КАК ДиректорГражданство
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтактактныеЛицаСгруппированные КАК вогСвязиКонтактныхЛиц       
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыДиректор
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыДиректор.Физлицо
	|				И (ДокументыДиректор.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ГенеральныйДиректор))
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыДиректорИн
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыДиректорИн.Физлицо
	|				И (ДокументыДиректорИн.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина))
	// -- VOG Солодов В.В. 19.02.2020
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ДиректорАдресаРегистрации
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДиректорАдресаРегистрации.Ссылка
	|				И (ДиректорАдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресРегистрацииКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ГенеральныйДиректор))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ДиректорАдресаПроживания
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДиректорАдресаПроживания.Ссылка
	|				И (ДиректорАдресаПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ГенеральныйДиректор))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ДиректорМестаРождения
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДиректорМестаРождения.Ссылка
	|				И (ДиректорМестаРождения.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_МестоРожденияКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ГенеральныйДиректор))
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.Ссылка
	|			И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ГенеральныйДиректор))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеКонтрагента.КонтактноеЛицо КАК СобственникФИО,
	|	ДанныеКонтрагента.ДатаРождения КАК ДатаРождения,
	|	ДанныеКонтрагента.МестоРождения КАК МестоРождения,
	|	ДанныеКонтрагента.АдресРегистрации КАК СобственникАдресРегистрации,
	|	ДанныеКонтрагента.АдресМестожительства КАК СобственникАдресМестожительства,
	|	ДанныеКонтрагента.ДанныеПаспорта КАК СобственникДанныеПаспорта,
	|	ДанныеКонтрагента.Гражданство КАК СобственникГражданство
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			ДанныеКонтрагента.КонтактноеЛицо КАК КонтактноеЛицо,
	|			ДанныеКонтрагента.ДатаРождения КАК ДатаРождения,
	|			ДанныеКонтрагента.Гражданство КАК Гражданство,
	|			ДанныеКонтрагента.МестоРождения КАК МестоРождения,
	|			ДанныеКонтрагента.АдресРегистрации КАК АдресРегистрации,
	|			ДанныеКонтрагента.АдресМестожительства КАК АдресМестожительства,
	|			ДанныеКонтрагента.ДанныеПаспорта КАК ДанныеПаспорта,
	|			ДанныеКонтрагента.ЭлектроннаяПочта КАК ЭлектроннаяПочта
	|		ИЗ
	|			(ВЫБРАТЬ
	|				вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК КонтактноеЛицо,
	|				ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).ДатаРождения КАК ДатаРождения,
	|				ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).вогГражданство КАК Гражданство,
	|				СобственникМестаРождения.Представление КАК МестоРождения,
	|				СобственникАдресаРегистрации.Представление КАК АдресРегистрации,
	|				СобственникАдресаПроживания.Представление КАК АдресМестожительства,
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|				ЕСТЬNULL(ДокументыСобственник.Представление, ДокументыСобственникИн.Представление) КАК ДанныеПаспорта,
	// До изменения
	//|				ДокументыСобственник.Представление КАК ДанныеПаспорта,
	// -- VOG Солодов В.В. 19.02.2020
	|				СобственникЭлПочта.Представление КАК ЭлектроннаяПочта,
	|				1 КАК Приоритет
	|			ИЗ
	|				ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтактактныеЛицаСгруппированные КАК вогСвязиКонтактныхЛиц
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыСобственник
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыСобственник.Физлицо
	|							И (ДокументыСобственник.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыСобственникИн
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыСобственникИн.Физлицо
	|							И (ДокументыСобственникИн.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина))
	// -- VOG Солодов В.В. 19.02.2020
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникАдресаРегистрации
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникАдресаРегистрации.Ссылка
	|							И (СобственникАдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресРегистрацииКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникАдресаПроживания
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникАдресаПроживания.Ссылка
	|							И (СобственникАдресаПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникМестаРождения
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникМестаРождения.Ссылка
	|							И (СобственникМестаРождения.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_МестоРожденияКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникЭлПочта
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникЭлПочта.Ссылка
	|							И (СобственникЭлПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_EmailРассылкиКонтактногоЛица))
	|					ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.Ссылка
	|						И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.Собственник))
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				вогСвязиКонтактныхЛиц.КонтактноеЛицо,
	|				ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).ДатаРождения,
	|				ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).вогГражданство,
	|				СобственникМестаРождения.Представление,
	|				СобственникАдресаРегистрации.Представление,
	|				СобственникАдресаПроживания.Представление,
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|				ЕСТЬNULL(ДокументыСобственник.Представление, ДокументыСобственникИн.Представление),
	// До изменения
	//|				ДокументыСобственник.Представление,
	// -- VOG Солодов В.В. 19.02.2020
	|				СобственникЭлПочта.Представление,
	|				2
	|			ИЗ
	|				ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтактактныеЛицаСгруппированные КАК вогСвязиКонтактныхЛиц
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыСобственник
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыСобственник.Физлицо
	|							И (ДокументыСобственник.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыСобственникИн
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыСобственникИн.Физлицо
	|							И (ДокументыСобственникИн.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина))
	// -- VOG Солодов В.В. 19.02.2020
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникАдресаРегистрации
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникАдресаРегистрации.Ссылка
	|							И (СобственникАдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресРегистрацииКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникАдресаПроживания
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникАдресаПроживания.Ссылка
	|							И (СобственникАдресаПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникМестаРождения
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникМестаРождения.Ссылка
	|							И (СобственникМестаРождения.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_МестоРожденияКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникЭлПочта
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникЭлПочта.Ссылка
	|							И (СобственникЭлПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_EmailРассылкиКонтактногоЛица))
	|					ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.Ссылка
	|						И (вогСвязиКонтактныхЛиц.Собственник = ИСТИНА)) КАК ДанныеКонтрагента) КАК ДанныеКонтрагента
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК ПодписантФИО,
	|	ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).ДатаРождения КАК ДатаРождения,
	|	ПодписантМестаРождения.Представление КАК МестоРождения,
	|	ПодписантАдресаРегистрации.Представление КАК ПодписантАдресРегистрации,
	|	ПодписантАдресаПроживания.Представление КАК ПодписантАдресМестожительства,
	|	ДокументыПодписант.Представление КАК ПодписантДанныеПаспорта,
	|	ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).вогГражданство КАК ПодписантГражданство
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтактактныеЛицаСгруппированные КАК вогСвязиКонтактныхЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыПодписант
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыПодписант.Физлицо
	|				И (ДокументыПодписант.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ПодписантАдресаРегистрации
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ПодписантАдресаРегистрации.Ссылка
	|				И (ПодписантАдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресРегистрацииКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ПодписантАдресаПроживания
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ПодписантАдресаПроживания.Ссылка
	|				И (ПодписантАдресаПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ПодписантМестаРождения
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ПодписантМестаРождения.Ссылка
	|				И (ПодписантМестаРождения.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_МестоРожденияКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.Ссылка
	|			И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаФизЛица()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вогЮридическиеЛица.Ссылка КАК Ссылка,
	|	вогЮридическиеЛица.НаименованиеПолное КАК Наименование,
	|	вогЮридическиеЛица.CRM_ИНН КАК CRM_ИНН,
	|	вогЮридическиеЛица.CRM_ОГРН КАК CRM_ОГРН
	|ПОМЕСТИТЬ ВТ_ЮридическиеЛица
	|ИЗ
	|	Справочник.вогЮридическиеЛица КАК вогЮридическиеЛица
	|ГДЕ
	|	вогЮридическиеЛица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЮридическиеЛица.Ссылка КАК Ссылка,
	|	ВТ_ЮридическиеЛица.Наименование КАК Наименование,
	|	ВТ_ЮридическиеЛица.CRM_ИНН КАК CRM_ИНН,
	|	ВТ_ЮридическиеЛица.CRM_ОГРН КАК CRM_ОГРН,
	|	ОбъектыЗначенийКлассификаторов.ЗначениеРеквизита КАК РегистрирующийОрган,
	|	ОбъектыЗначенийКлассификаторов_1.ЗначениеРеквизита КАК ДатаРегистрации
	|ПОМЕСТИТЬ ВТ_ДанныеКонтрагента
	|ИЗ
	|	ВТ_ЮридическиеЛица КАК ВТ_ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК ОбъектыЗначенийКлассификаторов
	|		ПО ВТ_ЮридическиеЛица.Ссылка = ОбъектыЗначенийКлассификаторов.Объект
	|			И (ОбъектыЗначенийКлассификаторов.ЗначениеКлассификатора = &ЗначениеКлассификатораРегистрирующийОрган)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК ОбъектыЗначенийКлассификаторов_1
	|		ПО ВТ_ЮридическиеЛица.Ссылка = ОбъектыЗначенийКлассификаторов_1.Объект
	|			И (ОбъектыЗначенийКлассификаторов_1.ЗначениеКлассификатора = &ЗначениеКлассификатораДатаРегистрации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязиЮридическихЛиц.ОбъектСвязи КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ТорговыеТочки
	|ИЗ
	|	ВТ_ЮридическиеЛица КАК ВТ_ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиЮридическихЛиц КАК СвязиЮридическихЛиц
	|		ПО ВТ_ЮридическиеЛица.Ссылка = СвязиЮридическихЛиц.ЮридическоеЛицо
	|			И (СвязиЮридическихЛиц.ОбъектСвязи ССЫЛКА Справочник.вогТорговыеТочки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//++ VOG Иванов С.А. 22.11.2019 ID заявки: 000000911
	|ВЫБРАТЬ
	|	ВТ_ДанныеКонтрагента.Ссылка КАК Ссылка,
	|	вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК КонтактноеЛицо,
	|	вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица КАК CRM_РольКонтактногоЛица,
	|	вогСвязиКонтактныхЛиц.Собственник КАК Собственник
	|ПОМЕСТИТЬ втКонтакты
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиКонтактныхЛиц КАК вогСвязиКонтактныхЛиц
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.ОбъектСвязи
	|			И (вогСвязиКонтактныхЛиц.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Работает))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеКонтрагента.Ссылка,
	|	вогРолиКонтактныхЛиц.КонтактноеЛицо,
	|	вогРолиКонтактныхЛиц.CRM_РольКонтактногоЛица,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогРолиКонтактныхЛиц КАК вогРолиКонтактныхЛиц
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = вогРолиКонтактныхЛиц.ОбъектСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКонтакты.Ссылка КАК Ссылка,
	|	втКонтакты.КонтактноеЛицо КАК КонтактноеЛицо,
	|	втКонтакты.CRM_РольКонтактногоЛица КАК CRM_РольКонтактногоЛица,
	|	МАКСИМУМ(втКонтакты.Собственник) КАК Собственник
	|ПОМЕСТИТЬ втКонтактактныеЛицаСгруппированные
	|ИЗ
	|	втКонтакты КАК втКонтакты
	|
	|СГРУППИРОВАТЬ ПО
	|	втКонтакты.Ссылка,
	|	втКонтакты.КонтактноеЛицо,
	|	втКонтакты.CRM_РольКонтактногоЛица
	|;
	|
	//-- VOG Иванов С.А. 22.11.2019 ID заявки: 000000911
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДанныеКонтрагента.Ссылка КАК Ссылка,
	|	ВТ_ДанныеКонтрагента.Наименование КАК Наименование,
	|	ВТ_ДанныеКонтрагента.CRM_ИНН КАК ИНН,
	|	ВТ_ДанныеКонтрагента.CRM_ОГРН КАК ОГРНИП,
	|	""Анкета для проверки контрагента в СБ (для ИП)"" КАК ЗаголовокШапки,
	|	ДанныеКонтрагента.ДатаРождения КАК ДатаРождения,
	|	ДанныеКонтрагента.Гражданство КАК Гражданство,
	|	ДанныеКонтрагента.МестоРождения КАК МестоРождения,
	|	ДанныеКонтрагента.АдресРегистрации КАК АдресРегистрации,
	|	ДанныеКонтрагента.АдресМестожительства КАК АдресМестожительства,
	|	ДанныеКонтрагента.ДанныеПаспорта КАК ДанныеПаспорта,
	|	ДанныеКонтрагента.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	|	ДанныеКонтрагента.РегистрирующийОрган КАК РегистрирующийОрган,
	|	ДанныеКонтрагента.ДатаРегистрации КАК ДатаРегистрации
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			ДанныеКонтрагента.ДатаРождения КАК ДатаРождения,
	|			ДанныеКонтрагента.Гражданство КАК Гражданство,
	|			ДанныеКонтрагента.МестоРождения КАК МестоРождения,
	|			ДанныеКонтрагента.АдресРегистрации КАК АдресРегистрации,
	|			ДанныеКонтрагента.АдресМестожительства КАК АдресМестожительства,
	|			ДанныеКонтрагента.ДанныеПаспорта КАК ДанныеПаспорта,
	|			ДанныеКонтрагента.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	|			ДанныеКонтрагента.РегистрирующийОрган КАК РегистрирующийОрган,
	|			ДанныеКонтрагента.ДатаРегистрации КАК ДатаРегистрации
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).ДатаРождения КАК ДатаРождения,
	|				ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).вогГражданство КАК Гражданство,
	|				СобственникМестаРождения.Представление КАК МестоРождения,
	|				СобственникАдресаРегистрации.Представление КАК АдресРегистрации,
	|				СобственникАдресаПроживания.Представление КАК АдресМестожительства,
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|				ЕСТЬNULL(ДокументыСобственник.Представление, ДокументыСобственникИн.Представление) КАК ДанныеПаспорта,
	// До изменения
	//|				ДокументыСобственник.Представление КАК ДанныеПаспорта,
	// -- VOG Солодов В.В. 19.02.2020
	|				СобственникЭлПочта.Представление КАК ЭлектроннаяПочта,
	|				ВТ_ДанныеКонтрагента.РегистрирующийОрган КАК РегистрирующийОрган,
	|				ВТ_ДанныеКонтрагента.ДатаРегистрации КАК ДатаРегистрации,
	|				1 КАК Приоритет
	|			ИЗ
	|				ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтактактныеЛицаСгруппированные КАК вогСвязиКонтактныхЛиц
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыСобственник
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыСобственник.Физлицо
	|							И (ДокументыСобственник.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыСобственникИн
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыСобственникИн.Физлицо
	|							И (ДокументыСобственникИн.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина))
	// -- VOG Солодов В.В. 19.02.2020
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникАдресаРегистрации
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникАдресаРегистрации.Ссылка
	|							И (СобственникАдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресРегистрацииКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникАдресаПроживания
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникАдресаПроживания.Ссылка
	|							И (СобственникАдресаПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникМестаРождения
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникМестаРождения.Ссылка
	|							И (СобственникМестаРождения.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_МестоРожденияКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникЭлПочта
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникЭлПочта.Ссылка
	|							И (СобственникЭлПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_EmailРассылкиКонтактногоЛица))
	|					ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.Ссылка
	|						И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.Собственник))
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).ДатаРождения,
	|				ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).вогГражданство,
	|				СобственникМестаРождения.Представление,
	|				СобственникАдресаРегистрации.Представление,
	|				СобственникАдресаПроживания.Представление,
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|				ЕСТЬNULL(ДокументыСобственник.Представление, ДокументыСобственникИн.Представление) КАК ДанныеПаспорта,
	// До изменения
	//|				ДокументыСобственник.Представление КАК ДанныеПаспорта,
	// -- VOG Солодов В.В. 19.02.2020
	|				СобственникЭлПочта.Представление,
	|				ВТ_ДанныеКонтрагента.РегистрирующийОрган,
	|				ВТ_ДанныеКонтрагента.ДатаРегистрации,
	|				2
	|			ИЗ
	|				ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтактактныеЛицаСгруппированные КАК вогСвязиКонтактныхЛиц
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыСобственник
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыСобственник.Физлицо
	|							И (ДокументыСобственник.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	// ++ VOG Солодов В.В. 19.02.2020 CRM-362
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыСобственникИн
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыСобственникИн.Физлицо
	|							И (ДокументыСобственникИн.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортИностранногоГражданина))
	// -- VOG Солодов В.В. 19.02.2020
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникАдресаРегистрации
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникАдресаРегистрации.Ссылка
	|							И (СобственникАдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресРегистрацииКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникАдресаПроживания
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникАдресаПроживания.Ссылка
	|							И (СобственникАдресаПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникМестаРождения
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникМестаРождения.Ссылка
	|							И (СобственникМестаРождения.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_МестоРожденияКонтактногоЛица))
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК СобственникЭлПочта
	|						ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = СобственникЭлПочта.Ссылка
	|							И (СобственникЭлПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_EmailРассылкиКонтактногоЛица))
	|					ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.Ссылка
	|						И (вогСвязиКонтактныхЛиц.Собственник = ИСТИНА)
	|			{УПОРЯДОЧИТЬ ПО
	|				Приоритет}) КАК ДанныеКонтрагента) КАК ДанныеКонтрагента
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК ПодписантФИО,
	|	ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).ДатаРождения КАК ДатаРождения,
	|	ПодписантМестаРождения.Представление КАК МестоРождения,
	|	ПодписантАдресаРегистрации.Представление КАК ПодписантАдресРегистрации,
	|	ПодписантАдресаПроживания.Представление КАК ПодписантАдресМестожительства,
	|	ДокументыПодписант.Представление КАК ПодписантДанныеПаспорта,
	|	ВЫРАЗИТЬ(вогСвязиКонтактныхЛиц.КонтактноеЛицо КАК Справочник.КонтактныеЛицаПартнеров).вогГражданство КАК ПодписантГражданство
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтактактныеЛицаСгруппированные КАК вогСвязиКонтактныхЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыПодписант
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ДокументыПодписант.Физлицо
	|				И (ДокументыПодписант.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ПодписантАдресаРегистрации
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ПодписантАдресаРегистрации.Ссылка
	|				И (ПодписантАдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресРегистрацииКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ПодписантАдресаПроживания
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ПодписантАдресаПроживания.Ссылка
	|				И (ПодписантАдресаПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ПодписантМестаРождения
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ПодписантМестаРождения.Ссылка
	|				И (ПодписантМестаРождения.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.CRM_МестоРожденияКонтактногоЛица))
	|				И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.Ссылка
	|			И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТорговыеТочкиКонтактнаяИнформация.Ссылка.Наименование КАК Наименование,
	|	ТорговыеТочкиКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	ВТ_ТорговыеТочки КАК ВТ_ТорговыеТочки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вогТорговыеТочки.КонтактнаяИнформация КАК ТорговыеТочкиКонтактнаяИнформация
	|		ПО ВТ_ТорговыеТочки.Ссылка = ТорговыеТочкиКонтактнаяИнформация.Ссылка
	|			И (ТорговыеТочкиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресТорговойТочки))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ++ VOG Солодов В.В. 19.02.2020 CRM-370
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТелефоныКЛ.Представление КАК Представление
	|ПОМЕСТИТЬ ВТ_ТелефоныКЛ
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиКонтактныхЛиц.СрезПоследних КАК вогСвязиКонтактныхЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ТелефоныКЛ
	|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ТелефоныКЛ.Ссылка
	|				И (ТелефоныКЛ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица)
	|					ИЛИ ТелефоныКЛ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица))
	|	ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.ОбъектСвязи
	|		И (вогСвязиКонтактныхЛиц.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Работает))
	|		И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.Собственник))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТелефоныКЛ.Представление
	|ИЗ
	|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.вогРолиКонтактныхЛиц КАК вогРолиКонтактныхЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ТелефоныКЛ
	|			ПО вогРолиКонтактныхЛиц.КонтактноеЛицо = ТелефоныКЛ.Ссылка
	|				И (ТелефоныКЛ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица)
	|					ИЛИ ТелефоныКЛ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица))
	|		ПО ВТ_ДанныеКонтрагента.Ссылка = вогРолиКонтактныхЛиц.ОбъектСвязи
	|			И (вогРолиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.Собственник))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТелефоныКЛ.Представление КАК Представление
	|ИЗ
	|	ВТ_ТелефоныКЛ КАК ВТ_ТелефоныКЛ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТелефоныКЛ.Представление";
	// До изменения
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТелефоныКЛ.Представление КАК Представление
	//|ИЗ
	//|	ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиКонтактныхЛиц.СрезПоследних КАК вогСвязиКонтактныхЛиц
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК ТелефоныКЛ
	//|			ПО вогСвязиКонтактныхЛиц.КонтактноеЛицо = ТелефоныКЛ.Ссылка
	//|				И (ТелефоныКЛ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица)
	//|					ИЛИ ТелефоныКЛ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица))
	//|	ПО ВТ_ДанныеКонтрагента.Ссылка = вогСвязиКонтактныхЛиц.ОбъектСвязи
	//|		И (вогСвязиКонтактныхЛиц.CRM_Состояние = ЗНАЧЕНИЕ(Перечисление.CRM_Состояние.Работает))
	//|		И (вогСвязиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.Собственник))
	// -- VOG Солодов В.В. 19.02.2020
	
	Возврат ТекстЗапроса;
	
КонецФункции
